/// Обертка для работы с текстовыми статичными данными
class DataWrapper {
  /// Строка "ФИО"
  static const String fio = 'Азорин Илья Евгеньевич';

  /// Строка "даты рождения"
  static const String birthday = 'Дата рождения: 17 марта 1997';

  /// Строка "местоположение"
  static const String location = 'Проживаю: Россия город Иваново';

  /// Строка "девиза"
  static const String slogan = 'Девиз: "Копировать тоже нужно уметь.."';

  /// Строка заголовка раздела "обо мне"
  static const String aboutMeTitle = 'Обо мне';

  /// Строка содержимого раздела "обо мне"
  static const String aboutMeContent =
      """ Разработчик мобильных и веб приложений, с опытом работы около 5 лет и образованием по специализации
  "Информационные системы и технологии". В стараюсь развивать и изучать новое в рамках своей специализации кроссплатформенной разработки. 
  Начинал с изучения Angular и .Net Core, потом занимался Cardova, после которой перешел во Flutter и на текущий момент работаю на нем и продолжаю изучать его.
  """;

  /// Строка заголовка раздела "увлечения"
  static const String myHobbyTitle = 'Увлечения';

  /// Строка содержимого раздела "увлечения"
  static const String myHobbyContent = """ Все мои увлечения более или менее относятся к компьютерам:
  - Железо и электроника, слежу за появлением новых технологий в компонентах той или иной электроники.
  - Программирование и разработка, да уже имею свое кладбище пет проектов, которые были интересны в свое время.
  - Видео монтаж и презентации, в силу работы увлекся красивым оформлением результатов своей работы для наглядности ее понимания.
  - Компьютерные игры и все с ними связанное.
  """;

  /// Строка заголовка раздела "опыт в разработке"
  static const String experienceTitle = 'Опыт в разработке';

  /// Строка содержимого раздела "опыт в разработке"
  static const String experienceContent = """
  Языки программирования:
C#, базовые навыки работы с SQL и Entity Framework, базовые знания HTML, CSS и JavaScript.
Базовые знания TypeScript и фреймворков NativeScript и Angular. Знание Flutter.

Опыт работы почти 5 лет.

1 год работы фулстек: разработка мобильного приложения на NativeScript + веб приложения на Angular + серверной части на .net Core + работа c Api Redmine.

2 и 3 год работы, разработка мобильного приложения:
Разрабатываю мобильное приложение под андроид на Flutter. Есть опыт написания приложения с ноля. Известны Архитектуры bloc и redux(RxDart). Есть опыт миграции проекта на null-safty. Понимание чистой архитектуры.

4 год работы посвящен доработке и развитию приложения, оптимизации производительности окно, и изучению авто публикации.

5 год работы посвящен рефакторингу и развитию приложения, началу разработки автотестов.
  """;
}
